In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name": ['raj', 'rohan', 'shashi', 'harsh'],
    "marks": [56, 78, 98, 89],
    "city": ['gwl', 'bhp', 'hyd', 'pune']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  marks  city
0     raj     56   gwl
1   rohan     78   bhp
2  shashi     98   hyd
3   harsh     89  pune

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_False_index.csv', index = False)

In [7]:
flight = pd.read_csv('flight.csv')

In [8]:
flight

      flight   Time  city
0     indigo  6 hrs   gwl
1    vistara   4hrs   bhp
2   spicejet  3 hrs   hyd
3  AIR India  8 hrs  pune

In [9]:
flight['Time']

0    6 hrs
1     4hrs
2    3 hrs
3    8 hrs
Name: Time, dtype: object

In [10]:
flight['Time'][0] = '7 hrs'

In [11]:
flight

      flight   Time  city
0     indigo  7 hrs   gwl
1    vistara   4hrs   bhp
2   spicejet  3 hrs   hyd
3  AIR India  8 hrs  pune

In [12]:
flight.index = ['first','second','third','fourth']

In [13]:
flight

           flight   Time  city
first      indigo  7 hrs   gwl
second    vistara   4hrs   bhp
third    spicejet  3 hrs   hyd
fourth  AIR India  8 hrs  pune

In [15]:
ser = pd.Series(np.random.rand)

In [17]:
type(ser)

pandas.core.series.Series

In [19]:
newdf = pd.DataFrame(np.random.rand(330, 5), index = np.arange(330))

In [23]:
type(newdf)
newdf.head()

          0         1         2         3         4
0  0.849368  0.474468  0.877632  0.153260  0.733745
1  0.265737  0.542924  0.028752  0.422770  0.313066
2  0.488514  0.002985  0.985117  0.576867  0.142142
3  0.057617  0.035917  0.055213  0.966465  0.490229
4  0.570055  0.140753  0.853235  0.646494  0.347687

In [22]:
newdf.describe()

                0           1           2           3           4
count  330.000000  330.000000  330.000000  330.000000  330.000000
mean     0.508149    0.481924    0.511826    0.522634    0.501950
std      0.282568    0.280924    0.292370    0.287846    0.283445
min      0.001828    0.002985    0.005805    0.000924    0.000989
25%      0.260432    0.245127    0.267981    0.277187    0.247835
50%      0.533975    0.468034    0.523190    0.536733    0.498013
75%      0.738907    0.730162    0.758707    0.798293    0.734641
max      0.998122    0.997608    0.997511    0.992940    0.991532

In [24]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [25]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       320, 321, 322, 323, 324, 325, 326, 327, 328, 329],
      dtype='int32', length=330)

In [26]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [27]:
newdf.to_numpy()

array([[0.84936787, 0.4744679 , 0.87763202, 0.1532597 , 0.73374469],
       [0.26573703, 0.54292427, 0.02875235, 0.42277006, 0.31306595],
       [0.48851431, 0.00298541, 0.98511679, 0.57686723, 0.14214184],
       ...,
       [0.15659793, 0.72300121, 0.63017399, 0.56647927, 0.44304801],
       [0.36114511, 0.17359584, 0.85479151, 0.19049294, 0.7278324 ],
       [0.56560996, 0.75023131, 0.26569314, 0.33984368, 0.29975755]])

In [28]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,320,321,322,323,324,325,326,327,328,329
0,0.849368,0.265737,0.488514,0.057617,0.570055,0.464542,0.013084,0.781740,0.660164,0.757735,...,0.671639,0.976118,0.797005,0.635978,0.630852,0.962907,0.719480,0.156598,0.361145,0.565610
1,0.474468,0.542924,0.002985,0.035917,0.140753,0.330059,0.055350,0.464142,0.111013,0.611298,...,0.967995,0.207139,0.423892,0.604944,0.561001,0.788509,0.494029,0.723001,0.173596,0.750231
2,0.877632,0.028752,0.985117,0.055213,0.853235,0.722626,0.862716,0.018675,0.685277,0.646306,...,0.525012,0.867010,0.622188,0.961144,0.010933,0.560695,0.556586,0.630174,0.854792,0.265693
3,0.153260,0.422770,0.576867,0.966465,0.646494,0.606053,0.964583,0.490340,0.986919,0.093593,...,0.021325,0.840353,0.973252,0.307112,0.178451,0.557942,0.453743,0.566479,0.190493,0.339844
4,0.733745,0.313066,0.142142,0.490229,0.347687,0.908601,0.088703,0.331323,0.838549,0.121159,...,0.583726,0.765648,0.546418,0.247423,0.325032,0.518689,0.386740,0.443048,0.727832,0.299758

In [29]:
newdf.head()

          0         1         2         3         4
0  0.849368  0.474468  0.877632  0.153260  0.733745
1  0.265737  0.542924  0.028752  0.422770  0.313066
2  0.488514  0.002985  0.985117  0.576867  0.142142
3  0.057617  0.035917  0.055213  0.966465  0.490229
4  0.570055  0.140753  0.853235  0.646494  0.347687

In [30]:
newdf[0]

0      0.849368
1      0.265737
2      0.488514
3      0.057617
4      0.570055
         ...
325    0.962907
326    0.719480
327    0.156598
328    0.361145
329    0.565610
Name: 0, Length: 330, dtype: float64